{
    "hidden_size": 256,
    "num_layers": 2,
    "num_attention_heads": 4,
    "attention_probs_dropout_prob": 0.0,
    "hidden_dropout_prob": 0.0,
    "ffn_intermediate_size": 256,
    "max_position_embeddings": 512,
    "initializer_range": 0.02,
    "layer_norm_eps": 1e-12,
    "pad_token_id": 0,
    "input_shape": [
        [
            168,
            1
        ],
        [
            168,
            35
        ],
        [
            24,
            35
        ]
    ],
    "architectures": [
        "nctional"
    ],
    "model_type": "tft"
}