{
    "rnn_hidden_size": 64,
    "rnn_type": "gru",
    "bi_direction": false,
    "dense_hidden_size": 128,
    "num_stacked_layers": 1,
    "scheduled_sampling": 0.0,
    "use_attention": false,
    "input_shape": [
        [
            168,
            1
        ],
        [
            168,
            34
        ],
        [
            24,
            31
        ]
    ],
    "architectures": [
        "nctional"
    ],
    "model_type": "rnn"
}