{
    "hidden_size": 64,
    "num_layers": 1,
    "num_decoder_layers": 1,
    "num_attention_heads": 1,
    "attention_probs_dropout_prob": 0.0,
    "ffn_intermediate_size": 128,
    "hidden_dropout_prob": 0.0,
    "prob_attention": false,
    "distil_conv": false,
    "input_shape": [
        [
            168,
            1
        ],
        [
            168,
            35
        ],
        [
            24,
            35
        ]
    ],
    "architectures": [
        "nctional"
    ],
    "model_type": "informer"
}