{
    "hidden_size": 64,
    "num_layers": 2,
    "num_attention_heads": 4,
    "ffn_intermediate_size": 256,
    "pooling_method": "mean",
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.0,
    "attention_probs_dropout_prob": 0.0,
    "type_vocab_size": 2,
    "initializer_range": 0.02,
    "layer_norm_eps": 1e-12,
    "positional_type": "positional encoding",
    "use_cache": false,
    "dense_units": [
        512,
        1024
    ],
    "classifier_dropout": null,
    "pad_token_id": 0,
    "input_shape": [
        [
            168,
            1
        ],
        [
            168,
            34
        ],
        [
            24,
            31
        ]
    ],
    "architectures": [
        "nctional"
    ],
    "model_type": "bert"
}