{
    "hidden_size": 256,
    "num_layers": 2,
    "num_decoder_layers": 4,
    "num_attention_heads": 4,
    "num_kv_heads": 4,
    "ffn_intermediate_size": 256,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.0,
    "attention_probs_dropout_prob": 0.0,
    "scheduled_sampling": 1,
    "max_position_embeddings": 512,
    "initializer_range": 0.02,
    "positional_type": "positional encoding",
    "use_cache": true,
    "classifier_dropout": null,
    "layer_norm_eps": 1e-12,
    "pad_token_id": 0,
    "input_shape": [
        [
            168,
            1
        ],
        [
            168,
            34
        ],
        [
            24,
            31
        ]
    ],
    "architectures": [
        "nctional"
    ],
    "model_type": "transformer"
}